In [2]:
import pandas as pd
import matplotlib

In [3]:
wc=pd.read_excel(r"C:\Users\sumit\Downloads\weather cit.xlsx")

In [4]:
wc

         city temperature  windspeed  event     day
0  2017-01-01    new york         32      6    Rain
1  2017-02-01    new york         36      7   Sunny
2  2017-03-01    new york         28     12    Snow
3  2017-04-01    new york         33      7   Sunny
4  2017-01-01      mumbai         90      5   Sunny
5  2017-02-01      mumbai         85     12     Fog
6  2017-03-01      mumbai         87     15     Fog
7  2017-04-01      mumbai         92      5    Rain
8  2017-01-01       paris         45     20   Sunny
9  2017-02-01       paris         50     13  Cloudy
10 2017-03-01       paris         54      8  Cloudy
11 2017-04-01       paris         42     10  Cloudy

In [14]:
t1=wc.groupby('temperature')

In [15]:
t1

In [16]:
for temperature,temperature_wc in t1:
print('temperature')
print('temperature_wc')

IndentationError: expected an indented block (<ipython-input-16-2cd08dd65ce1>, line 2)

In [17]:
%matblotlib inline
t1.plot()

UsageError: Line magic function `%matblotlib` not found.

In [21]:
iw=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],"temp":[35,37,25],"sl":[2,3,1]
})

In [22]:
iw

       city  temp  sl
0    mumbai    35   2
1     delhi    37   3
2  banglore    25   1

In [23]:
usw=pd.DataFrame({
    "city":["ny","wdc","ty"],"temp":[27,31,25],"sl":[3,4,1]
})
usw

  city  temp  sl
0   ny    27   3
1  wdc    31   4
2   ty    25   1

In [30]:
niu=pd.concat([iw,usw],keys=["iw","usw"])

In [31]:
niu

           city  temp  sl
iw  0    mumbai    35   2
    1     delhi    37   3
    2  banglore    25   1
usw 0        ny    27   3
    1       wdc    31   4
    2        ty    25   1

In [43]:
iw1=pd.DataFrame({
    "city":["ny","wdc","ty"],"sl":[2,3,1]
})
iw1

  city  sl
0   ny   2
1  wdc   3
2   ty   1

In [44]:
usw1=pd.DataFrame({
    "city":["ny","wdc","ty"],"temp":[27,31,25],
})
usw

  city  temp  sl
0   ny    27   3
1  wdc    31   4
2   ty    25   1

In [45]:
rr=pd.merge(iw1,usw1,on="city")

In [46]:
rr

  city  sl  temp
0   ny   2    27
1  wdc   3    31
2   ty   1    25